## PANDAS

In [2]:
import numpy as np
import pandas as pd

In [5]:
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array(my_list)
d={'a':10,'b':20,'c':30}

In [8]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [19]:
sales=pd.Series(data=[100,250,225,300],index=["USA","France","China","Turkey"])

In [20]:
sales

USA       100
France    250
China     225
Turkey    300
dtype: int64

In [21]:
sales2=pd.Series(data=[100,250,225,186],index=["USA","France","China","India"])

In [22]:
sales2

USA       100
France    250
China     225
India     186
dtype: int64

In [23]:
sales2[0]

100

In [24]:
sales2["USA"]

100

In [26]:
sales+sales2

China     450.0
France    500.0
India       NaN
Turkey      NaN
USA       200.0
dtype: float64

## DATA FRAMES

In [27]:
columns=["W","X","Y","Z"]

In [28]:
index=["A","B","C","D","E"]

In [31]:
from numpy.random import randint

data=randint(-100,100,(5,4))

In [32]:
data

array([[-71,  80,  88,  14],
       [ 38,  69, -36, -24],
       [ 48,  87,  47,  12],
       [ 61, -31, -16,  75],
       [-14, -60,  14,  49]])

In [39]:
df=pd.DataFrame(data,index,columns)

In [40]:
df

    W   X   Y   Z
A -71  80  88  14
B  38  69 -36 -24
C  48  87  47  12
D  61 -31 -16  75
E -14 -60  14  49

In [41]:
df["W"]

A   -71
B    38
C    48
D    61
E   -14
Name: W, dtype: int32

In [43]:
df["H"]=df["W"]+df["Z"]
df

    W   X   Y   Z    H
A -71  80  88  14  -57
B  38  69 -36 -24   14
C  48  87  47  12   60
D  61 -31 -16  75  136
E -14 -60  14  49   35

In [44]:
df.drop("H",axis=1)

    W   X   Y   Z
A -71  80  88  14
B  38  69 -36 -24
C  48  87  47  12
D  61 -31 -16  75
E -14 -60  14  49

In [45]:
df.loc["A"]

W   -71
X    80
Y    88
Z    14
H   -57
Name: A, dtype: int32

In [46]:
df.iloc[-1]

W   -14
X   -60
Y    14
Z    49
H    35
Name: E, dtype: int32

In [48]:
df.loc[["A","C"],["W","Y"]]

    W   Y
A -71  88
C  48  47

In [49]:
df>0

       W      X      Y      Z      H
A  False   True   True   True  False
B   True   True  False  False   True
C   True   True   True   True   True
D   True  False  False   True   True
E  False  False   True   True   True

In [50]:
df["X"]>0

A     True
B     True
C     True
D    False
E    False
Name: X, dtype: bool

In [52]:
(df["W"]>0) & (df["X"]<0)

A    False
B    False
C    False
D     True
E    False
dtype: bool

In [53]:
df[(df["W"]>0) & (df["X"]<0)]

    W   X   Y   Z    H
D  61 -31 -16  75  136

In [55]:
df.reset_index()

  index   W   X   Y   Z    H
0     A -71  80  88  14  -57
1     B  38  69 -36 -24   14
2     C  48  87  47  12   60
3     D  61 -31 -16  75  136
4     E -14 -60  14  49   35

In [58]:
new_index=["IN","FR","TR","AU","GER"]
df["States"]=new_index
df

    W   X   Y   Z    H States
A -71  80  88  14  -57     IN
B  38  69 -36 -24   14     FR
C  48  87  47  12   60     TR
D  61 -31 -16  75  136     AU
E -14 -60  14  49   35    GER

In [59]:
df.set_index("States")

         W   X   Y   Z    H
States
IN     -71  80  88  14  -57
FR      38  69 -36 -24   14
TR      48  87  47  12   60
AU      61 -31 -16  75  136
GER    -14 -60  14  49   35

In [62]:
df.describe()

               W          X          Y          Z           H
count   5.000000   5.000000   5.000000   5.000000    5.000000
mean   12.400000  29.000000  19.400000  25.200000   37.600000
std    54.628747  69.076045  49.545938  37.969725   70.173357
min   -71.000000 -60.000000 -36.000000 -24.000000  -57.000000
25%   -14.000000 -31.000000 -16.000000  12.000000   14.000000
50%    38.000000  69.000000  14.000000  14.000000   35.000000
75%    48.000000  80.000000  47.000000  49.000000   60.000000
max    61.000000  87.000000  88.000000  75.000000  136.000000

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int32
 1   X       5 non-null      int32
 2   Y       5 non-null      int32
 3   Z       5 non-null      int32
 4   H       5 non-null      int32
 5   States  5 non-null      object
dtypes: int32(5), object(1)
memory usage: 340.0+ bytes

## MISSING DATA

In [76]:
df=pd.DataFrame({"A":[1,7,np.nan,18,],
                 "B":[10,np.nan,4,78],
                 "C":[10,45,55,32],
                 "D":[3,9,13,27]})

In [77]:
df

      A     B   C   D
0   1.0  10.0  10   3
1   7.0   NaN  45   9
2   NaN   4.0  55  13
3  18.0  78.0  32  27

In [78]:
df.dropna()

      A     B   C   D
0   1.0  10.0  10   3
3  18.0  78.0  32  27

In [84]:
df.dropna(axis=1)

    C   D
0  10   3
1  45   9
2  55  13
3  32  27

In [87]:
df.fillna("degerkoy")

          A         B   C   D
0         1        10  10   3
1         7  degerkoy  45   9
2  degerkoy         4  55  13
3        18        78  32  27

In [88]:
df.fillna(4)

      A     B   C   D
0   1.0  10.0  10   3
1   7.0   4.0  45   9
2   4.0   4.0  55  13
3  18.0  78.0  32  27

In [89]:
df.fillna(df.mean())

           A          B   C   D
0   1.000000  10.000000  10   3
1   7.000000  30.666667  45   9
2   8.666667   4.000000  55  13
3  18.000000  78.000000  32  27